Repository: formencode/formencode
Catalog: src/formencode/i18n/*/FormEncode.po
Languages: ka

source: Please enter a value
ka: შეიყვანეთ მნიშვნელობა

source: The input must be a string (not a %(type)s: %(value)r)
ka: შეყვანის ტიპი სტრიქონი უნდა იყოს (და არა %(type)s: %(value)r)

source: The input must be a string (not None)
ka: შეყვანის ტიპი სტრიქონი უნდა იყოს (და არა არაფერი)

source: Belarus
ka: ბელარუსი

source: Montenegro
ka: მონტენეგრო

source: Tasmania
ka: ტასმანია

source: Britain
ka: ბრიტანეთი

source: Great Britain
ka: დიდი ბრიტანეთი

source: Cote de Ivoire
ka: კოტ-დ’ივუარი

source: %d digits
ka: %d ციფრი

source: Please enter a zip code (%(format)s)
ka: შეიყვანეთ საფოსტო კოდი (%(format)s)

source: Please enter a zip code (%s)
ka: შეიყვანეთ საფოსტო კოდი (%s)

source: Please enter a valid postal code (for format see BS 7666)
ka: შეიყვანეთ სწორი საფოსტო კოდი (ფორმატისთვის იხილეთ BS 7666)

source: That country is not listed in ISO 3166
ka: მითითებული ქვეყანა არაა სიაში ISO 3166

source: Given postal code does not match the country's format.
ka: მითითებული საფოსტო კოდი ქვეყნის ფორმატს არ ემთხვევა.

source: Please enter a state code
ka: შეიყვანეთ ქვეყნის კოდი

source: Please enter a state code with TWO letters
ka: შეიყვანეთ ქვეყნის კოდი ორი ასოთი

source: That is not a valid state code
ka: ეს ქვეყნის კოდი არასწორია

source: Please enter a number, with area code, in the form ###-###-####, optionally with "ext.####"
ka: შეიყვანეთ ნომერი რეგიონის კოდით, ფორმით ###-###-####, ასევე შეგიძლიათ დაამატოთ 'ext.####'

source: Please enter a number, with area code, in the form +##-###-#######.
ka: შეიყვანეთ ნომერი რეგიონის კოდით, ფორმით +##-###-#######.

source: That language is not listed in ISO 639
ka: ეს ენა არაა სიაში ISO 639

source: The input field %(name)s was not expected.
ka: შეყვანის ველი %(name)s მოულოდნელია.

source: Missing value
ka: აკლია მნიშვნელობა

source: The input must be dict-like (not a %(type)s: %(value)r)
ka: შეყვანა ლექსიკონის მსგავსი უნდა იყოს (და არა %(type)s: %(value)r)

source: Please provide only one value
ka: შეიყვანეთ, მხოლოდ, ერთი მნიშვნელობა

source: %(object)r is not a subclass of %(subclass)s
ka: %(object)r არ წარმოადგენს %(subclass)s-ის ქვეკლასს

source: %(object)r is not a subclass of one of the types %(subclassList)s
ka: %(object)r არ წარმოადგენს %(subclassList)s-ის ტიპების ქვეკლასს

source: %(object)r must be one of the types %(typeList)s
ka: %(object)r %(typeList)s-ის ერთ-ერთი ტიპის უნდა იყოს

source: %(object)r must be of the type %(type)s
ka: %(object)r %(type)s-ის ტიპის უნდა იყოს

source: Enter a value less than %(maxLength)i characters long
ka: შეიყვანეთ მნიშვნელობა, რომლის სიგრძეც %(maxLength)i სიმბოლოზე ნაკლებია

source: Invalid value (value with length expected)
ka: არასწორი მნიშვნელობა (მოველოდი სიგრძის მნიშვნელობას)

source: Enter a value at least %(minLength)i characters long
ka: შეიყვანეთ მნიშვნელობა, რომელიც, ყველაზე ცოტა, %(minLength)i სიმბოლოს შეიცავს

source: You cannot enter a value here
ka: აქ მნიშვნელობას ვერ შეიყვანთ

source: The input is not valid
ka: შეყვანა არასწორია

source: Enter only letters, numbers, or _ (underscore)
ka: შეიყვანეთ, მხოლოდ, ასოები, ციფრები, ან _ (ქვედა ტირე)

source: Invalid value
ka: არასწორი მნიშვნელობა

source: Value must be one of: %(items)s (not %(value)r)
ka: მნიშვნელობა უნდა იყოს ერთ-ერთი: %(items)s (და არა %(value)r)

source: Choose something
ka: აირჩიეთ რამე

source: Enter a value from: %(items)s
ka: შეიყვანეთ მნიშვნელობა ელემენტიდან: %(items)s

source: That value is not known
ka: ეს მნიშვნელობა უცნობია

source: Nothing in my dictionary goes by the value %(value)s. Choose one of: %(items)s
ka: ჩემს ლექსიკონში არაფერი ემთხვევა მნიშვნელობას %(value)s. აირჩიეთ ერთ-ერთი: %(items)s

source: Must be an integer index
ka: უნდა იყოს მთელი რიცხვი ინდექსი

source: Index out of range
ka: ინდექსი დიაპაზონს გარეთაა

source: Item %(value)s was not found in the list
ka: ელემენტი %(value)s სიაში აღმოჩენილი არაა

source: Date must be after %(date)s
ka: თარიღი %(date)s-ის შემდეგ უნდა იყოს

source: Date must be before %(date)s
ka: თარიღი %(date)s-მდე უნდა იყოს

source: The date must be sometime in the future
ka: თარიღი მომავალში უნდა იყოს

source: Please enter a number that is %(min)s or greater
ka: შეიყვანეთ რიცხვი, რომელიც %(min)s ან მეტია

source: Please enter a number that is %(max)s or smaller
ka: შეიყვანეთ რიცხვი, რომელიც %(max)s ან ნაკლებია

source: Please enter an integer value
ka: შეიყვანეთ მთელი რიცხვი

source: Please enter a number
ka: შეიყვანეთ რიცხვი

source: Enter a value not more than %(max)i characters long
ka: შეიყვანეთ მნიშვნელობა, რომელიც მაქს. %(max)i სიმბოლოს შეიცავს

source: Enter a value %(min)i characters long or more
ka: შეიყვანეთ მნიშვნელობა, რომელიც, სულ ცოტა, %(min)i სიმბოლოს შეიცავს

source: Invalid data or incorrect encoding
ka: არასწორი მონაცემები ან არასწორი კოდირება

source: Please enter an email address
ka: შეიყვანეთ ელფოსტის მისამართი

source: An email address must contain a single @
ka: ელფოსტის მისამართი ერთ @-ს უნდა შეიცავდეს

source: The username portion of the email address is invalid (the portion before the @: %(username)s)
ka: ელფოსტის მისამართის მომხმარებლის სახელის ნაწილი არასწორია (ნაწილი @-მდე: %(username)s)

source: An error occured when trying to connect to the server: %(error)s
ka: შეცდომა სერვერთან მიერთების მცდელობისას: %(error)s

source: The domain portion of the email address is invalid (the portion after the @: %(domain)s)
ka: ელფოსტის მისამართის დომენის ნაწილი არასწორია (ნაწილი @-ის შემდეგ: %(domain)s)

source: The domain of the email address does not exist (the portion after the @: %(domain)s)
ka: ელფოსტის მისამართის დომენის ნაწილი არ არსებობს (ნაწილი @-ის შემდეგ: %(domain)s)

source: You must start your URL with http://, https://, etc
ka: ბმული http://, https:// და ა.შ. პრეფიქსით უნდა იწყებოდეს

source: That is not a valid URL
ka: ეს არასწორი ბმულია

source: An error occurred when trying to access the URL: %(error)s
ka: შეცდომა ბმულთან წვდომის მცდელობისას: %(error)s

source: The server responded that the page could not be found
ka: სერვერმა დააბრუნა პასუხი, რომ გვერდი აღმოჩენილი არაა

source: The server responded with a bad status code (%(status)s)
ka: სერვერმა ცუდი სტატუსის კოდი დააბრუნა (%(status)s)

source: You must provide a full domain name (like %(domain)s.com)
ka: უნდა შეიყვანოთ სრული დომენის სახელი (მაგ: %(domain)s.com)

source: The type of i-name is not defined; it may be either individual or organizational
ka: i-name-ის ტიპი აღწერილი არაა. ის, შეიძლება, იყოს ინდივიდუალური ან ორგანიზაციის

source: Dots and dashes may not be repeated consecutively
ka: წერტილების და ტირეების თანმიმდევრულად გამეორება შეუძლებელია

source: "%(iname)s" is an invalid i-name
ka: "%(iname)s" არასწორი i-name-ია

source: i-names may not start with numbers nor punctuation marks
ka: i-name არ შეიძლება, პუნქტუაციის ნიშნებით, ან რიცხვით იწყებოდეს

source: "%(inumber)s" is an invalid i-number
ka: "%(inumber)s" არასწორი i-number-ა

source: The XRI must be a string (not a %(type)s: %(value)r)
ka: XRI სტრიქონი უნდა იყოს (და არა %(type)s: %(value)r)

source: "%(xri_type)s" is not a valid type of XRI
ka: "%(xri_type)s" XRI-ის არასწორი ტიპია

source: "%(id)s" is not a valid OpenId (it is neither an URL nor an XRI)
ka: "%(id)s" სწორი OpenId არაა (ის არც ბმულია, არც XRI)

source: Please enter the date in the form %(format)s
ka: შეიყვანეთ თარიღი ფორმით %(format)s

source: Please enter a month from 1 to 12
ka: შეიყვანეთ თვე 1-12

source: Please enter a valid day
ka: შეიყვანეთ სწორი დღე

source: That month only has %(days)i days
ka: იმ თვეს, მხოლოდ, %(days)i დღე აქვს

source: That is not a valid day (%(exception)s)
ka: ეს არასწორი დღეა (%(exception)s)

source: Unknown month name: %(month)s
ka: უცნობი თვის სახელი: %(month)s

source: Please enter a number for the year
ka: შეიყვანეთ რიცხვი წლისთვის

source: Please enter a four-digit year after 1899
ka: შეიყვანეთ ოთხციფრიანი წელი 1899-ის შემდეგ

source: You must indicate AM or PM
ka: უნდა მიუთითოთ, AM, თუ PM

source: There are too many :'s
ka: გამოყენებულია მეტისმეტად ბევრი ':'

source: You may not enter seconds
ka: წამები არ უნდა შეიყვანოთ

source: You must enter seconds
ka: წამები უნდა შეიყვანოთ

source: You must enter minutes (after a :)
ka: წუთები უნდა შეიყვანოთ (:-ის შემდეგ)

source: The %(part)s value you gave is not a number: %(number)r
ka: %(part)s-ის მნიშვნელობა, რომელიც შეიყვანეთ, რიცხვი არაა: %(number)r

source: You must enter an hour in the range %(range)s
ka: უნდა შეიყვანოთ საათი შუალედიდან %(range)s

source: You must enter a minute in the range 0-59
ka: უნდა შეიყვანოთ წუთი შუალედიდან 0-59

source: You must enter a second in the range 0-59
ka: უნდა შეიყვანოთ წამი შუალედიდან 0-59

source: The name %(name)s is missing
ka: სახელი %(name)s აკლია

source: Value should be %(true)r or %(false)r
ka: მნიშვნელობა უნდა იყოს %(true)r, ან %(false)r

source: Value does not contain a signature
ka: მნიშვნელობა ხელმოწერას არ შეიცავს

source: Signature is not correct
ka: ხელმოწერა არასწორია

source: Please enter a valid IP address (a.b.c.d)
ka: შეიყვანეთ სწორი IP მისამართი (a.b.c.d)

source: The octets must not have leading zeros
ka: ოქტეტებს წინ ნულები მიწერილი არ უნდა ჰქონდეთ

source: The octets must be within the range of 0-255 (not %(octet)r)
ka: ოქტეტები უნდა იყოს შუალედში 0-255 (და არა %(octet)r)

source: Please enter a valid IP address (a.b.c.d) or IP network (a.b.c.d/e)
ka: შეიყვანეთ სწორი IP მისამართი (a.b.c.d.) ან IP ქსელი (a.b.c.d/e)

source: The network size (bits) must be within the range of 8-32 (not %(bits)r)
ka: ქსელის ზომა (ბიტები) უნდა იყოს შუალედიდან 8-32 (და არა %(bits)r)

source: A MAC address must contain 12 digits and A-F; the value you gave has %(length)s characters
ka: MAC მისამართი უნდა შეიცავდეს 12 ციფრს და ასოს შუალედიდან A-F. თქვენს შეყვანილ მნიშვნელობაში %(length)s სიმბოლოა

source: MAC addresses may only contain 0-9 and A-F (and optionally :), not %(char)r
ka: MAC მისამართი, მხოლოდ, 0-9 და A-F (და არასავალდებულო :) სიმბოლოებს შეიძლება, შეიცავდეს, მაგრამ არა სიმბოლოს %(char)r

source: You must give a value for %s
ka: %s-ის მნიშვნელობის შეყვანა აუცილებელია

source: Fields do not match (should be %(match)s)
ka: ველები არ ემთხვევა (უნდა იყოს %(match)s)

source: Fields do not match
ka: ველები არ ემთხვევა

source: Fields should be a dictionary
ka: ველები უნდა იყოს ლექსიკონი

source: Please enter only the number, no other characters
ka: შეიყვანეთ, მხოლოდ, რიცხვი და არა სხვა სიმბოლოები

source: You did not enter a valid number of digits
ka: თქვენ არ შეიყვანეთ ციფრების სწორი რაოდენობა

source: That number is not valid
ka: ის რიცხვი არასწორია

source: The field %(key)s is missing
ka: ველი %(key)s აღმოჩენილი არაა

source: Please enter numbers only for month and year
ka: შეიყვანეთ რიცხვები, მხოლოდ, თვისთვის და წლისთვის

source: Invalid Expiration Date
ka: არასწორი ვადა

source: Please enter numbers only for credit card security code
ka: შეიყვანეთ რიცხვები, მხოლოდ, საკრედიტო ბარათის უსაფრთხოების კოდისთვის

source: Invalid credit card security code length
ka: არასწორი საკრედიტო ბარათის უსაფრთხოების კოდის სიგრძე
